[
    {
      "id": 1,
      "company_logo": "https://i.ibb.co/47VpTWd/google-1-1-1.png",
      "job_title": "Software Engineer",
      "company_name": "Google LLC",
      "remote_or_onsite": "Remote",
      "location": "New York, NY",
      "fulltime_or_parttime": "Fulltime",
      "salary": "$120,000 - $150,000",
      "job_description": "As a software engineer at Google, you will be responsible for developing and maintaining high-quality software applications and systems that power Google's products and services. You will work on a range of projects, from designing and implementing new features to troubleshooting and optimizing existing code.",
      "job_responsibility": "Design, develop, and maintain software applications and systems using various programming languages and frameworks.Collaborate with cross-functional teams to define, design, and ship new features.Write clean, efficient, and well-documented code that meets Google's coding standards and best practices.Work with product managers, designers, and other stakeholders to understand customer needs and provide technical solutions.Stay up-to-date with emerging technologies and industry trends to inform software development decisions.",

      "educational_requirements": "Bachelor's degree in Computer Science or related field.Strong programming skills in one or more of the following languages: C++, Java, Python, or Go.Ability to work collaboratively in a team environment and communicate effectively with technical and non-technical stakeholders",
      "experiences": "3+ years of experience in software engineering",
      "contact_information": {
        "phone": "555-1234",
        "email": "jobs@acmecorp.com"
      }
    },
    {
      "id": 2,   
      "company_logo": "https://i.ibb.co/xfFB37t/pngegg-1.png",
      "job_title": "Marketing Manager",
      "company_name": "Amazon",
      "remote_or_onsite": "Onsite",
      "location": "Los Angeles, CA",
      "fulltime_or_parttime": "Fulltime",
      "salary": "$80,000 - $100,000",
      "job_description": "As a Marketing Manager at Amazon, you will be responsible for developing and executing marketing campaigns that promote Amazon products and services. You will work closely with cross-functional teams, including product managers, designers, engineers, and analysts, to develop and implement effective marketing strategies that drive customer acquisition and retention.",
      "job_responsibility": "Develop and execute integrated marketing campaigns across multiple channels, including email, social media, paid advertising, and events.Collaborate with product teams to understand product features, benefits, and target audience, and translate them into compelling marketing messaging and positioning.Conduct market research and competitive analysis to identify customer needs, market trends, and opportunities for growth.Develop marketing plans and budgets that align with business objectives and track and report on campaign performance metrics.Develop and maintain relationships with external partners, agencies, and vendors to support marketing initiatives.",
      "educational_requirements": "Bachelor's degree in Marketing, Communications, or a related field.Strong analytical and quantitative skills, with experience using data to inform marketing decisions.Experience managing a team and driving results through others.Excellent written and verbal communication skills.",
      "experiences": "5+ years of experience in marketing, with a focus on digital marketing and campaign management",
      "contact_information": {
        "phone": "555-5678",
        "email": "jobs@xyzinc.com"
      }
    },
    {
      "id": 3,
      "company_logo": "https://i.ibb.co/PrtfBQ8/microsoft-logo-png-2398.png",
      "job_title": "Graphic Designer",
      "company_name": "Microsoft",
      "remote_or_onsite": "Remote",
      "location": "San Francisco, CA",
      "fulltime_or_parttime": "Part-time",
      "salary": "$40 - $50 per hour",
      "job_description": "As a Graphic Designer at Microsoft, you will be responsible for creating and designing graphics that visually communicate Microsoft's brand and messaging. You will work closely with cross-functional teams, including marketing, product, and UX teams, to develop designs that are creative, effective, and align with Microsoft's brand guidelines.",
      "job_responsibility": "Create and design graphics for various mediums, including digital, print, and social media.Work with cross-functional teams to develop visual designs that communicate brand messaging and resonate with target audiences.Design and produce marketing materials, including infographics, flyers, brochures, and other collateral.Manage projects and timelines to ensure timely delivery of high-quality designs.",
      "educational_requirements": "Bachelor's degree in Graphic Design or a related field.Proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign) and other design tools.Strong portfolio showcasing design skills and ability to create visually appealing designs that communicate messaging effectively",
      "experiences": "3+ years of experience in graphic design, with a focus on digital design",
      "contact_information": {
        "phone": "555-9012",
        "email": "jobs@abccorp.com"
      }
    },
    {
      "id": 4,
      "company_logo": "https://i.ibb.co/jWb2db3/netflix-4-1.png",
      "job_title": "Sales Representative",
      "company_name": "Netflix",
      "remote_or_onsite": "Onsite",
      "location": "Chicago, IL",
      "fulltime_or_parttime": "Fulltime",
      "salary": "$60,000 - $80,000",
      "job_description": "As a Sales Representative at Netflix, you will be responsible for driving revenue growth by selling Netflix's products and services to potential clients. You will work closely with cross-functional teams, including marketing, content, and finance teams, to develop sales strategies that align with Netflix's business objectives and drive customer acquisition and retention.",
      "job_responsibility": "Conduct research and analysis to understand market trends, customer needs, and competition, and use this information to inform sales strategies.Develop and deliver sales presentations and proposals that effectively communicate the value of Netflix's products and services to potential clients.Track and report on sales performance metrics and use data to continuously improve sales strategies and tactics.Negotiate contracts and pricing with clients to achieve win-win outcomes that align with Netflix's business objectives.Collaborate with internal teams to ensure timely delivery of products and services and to resolve any customer issues or concerns.",
      "educational_requirements": "Bachelor's degree in Business Administration, Sales, or a related field.Experience in B2B sales, preferably in the media or entertainment industry.Excellent communication and interpersonal skills, with the ability to build rapport with clients and internal stakeholders.Ability to work independently and prioritize multiple projects and tasks",
      "experiences": "5+ years of experience in sales, with a track record of achieving or exceeding sales targets",
      "contact_information": {
        "phone": "555-3456",
        "email": "jobs@123co.com"
      }
    },
    {
      "id":5, 
      "company_logo": "https://i.ibb.co/DVjD4Qh/pngegg-2.png",
      "job_title": "Data Scientist",
      "company_name": "Facebook",
      "remote_or_onsite": "Remote",
      "location": "Seattle, WA",
      "fulltime_or_parttime": "Fulltime",
      "salary": "$120,000 - $150,000",
      "job_description": "As a Data Scientist at Facebook, you will be responsible for using data-driven insights to inform business decisions and improve user experiences. You will work closely with cross-functional teams, including product, engineering, and research teams, to analyze data, develop models, and provide recommendations that drive product and business outcomes.",
      "job_responsibility": "Analyze large and complex data sets using statistical methods, machine learning, and other data analysis techniques to identify patterns, trends, and insights.Work with cross-functional teams to identify key business questions and develop data-driven solutions to address them.Design experiments to test hypotheses and evaluate the impact of product and business initiatives.Continuously monitor and improve the performance of data models and algorithms",
      "educational_requirements": "Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field.Strong proficiency in SQL, Python, R, or other programming languages used for data analysis and modeling.Strong problem-solving and critical-thinking skills, with the ability to approach complex problems in a structured and analytical manner.Excellent communication and interpersonal skills, with the ability to work collaboratively with cross-functional teams",
      "experiences": "3+ years of experience in data analysis, data modeling, and statistical analysis",
      "contact_information": {
      "phone": "555-7890",
      "email": "jobs@bigdatainc.com"
      }
      },
      {
      "id": 6,
      "company_logo": "https://i.ibb.co/Qd24F77/tesla-9-1.png",
      "job_title": "Human Resources Manager",
      "company_name": "Tesla",
      "remote_or_onsite": "Onsite",
      "location": "Dallas, TX",
      "fulltime_or_parttime": "Fulltime",
      "salary": "$90,000 - $110,000",
      "job_description": "As a Human Resources Manager at Tesla, you will be responsible for providing strategic and operational support for all aspects of human resources management. You will work closely with business leaders, employees, and the HR team to develop and implement HR policies and programs that align with Tesla's business objectives and promote a positive and inclusive work environment.",
      "job_responsibility": "Partner with business leaders to understand their workforce needs and provide HR guidance and support to achieve business objectives.Develop and implement HR policies, programs, and initiatives that promote a positive and inclusive work environment and align with Tesla's culture and values.Provide guidance and support to employees on HR-related matters, including compensation, benefits, performance management, and employee relations.Ensure compliance with applicable laws and regulations, including employment laws, labor laws, and privacy laws.Manage and develop a team of HR professionals to provide excellent customer service and HR support to employees and business leaders.",
      "educational_requirements": "Bachelor's degree in Human Resources, Business Administration, or a related field.Strong knowledge of HR laws and regulations, including employment laws, labor laws, and privacy laws.Excellent communication and interpersonal skills, with the ability to build rapport with employees and business leaders at all levels of the organization.Ability to work independently and prioritize multiple projects and tasks.",
      "experiences": "5+ years of experience in HR management, with a focus on employee relations, talent management, and HR operations.",
      "contact_information": {
      "phone": "555-2345",
      "email": "jobs@hrsolutions.com"
      }
      }
      ]
     